local

বাজার, চাল, পোলার চাল, চাউল, মাছ, গোস্তো, গোসত, গোস্ত, মুরগী, মুরগি, কক মুরগি, তেল, তৈল, সয়াবিন তেল, সয়াবিন, পেয়াজ, পিয়াজ, হলুদ, হলদি, সরিষা তৈল, শরিসা তৈল, সরিশা তৈল, রশুন, রসুন, আদা, তাল-মিশ্রি, তাল মিশ্রি, ময়দা, আলু, ডাল, লবণ, দুধ, নুডুলস, চিনা বাদাম, সেমাই, হুইল পাউডার, চিনি, মসলা, সাবান, ভিমবার, ডিম, মরিচ, টমেটো, রেহা, মুলা, পেঁয়াজ, তরকারি, অন্যন্য বাজার, ধইন্যাপাতা, পান, পেপে, বরবটি, আমরা, ধইন্যা পাতা, লেবু, সিম, হলুদের গুরা, পাঙ্গাস, পাঙ্গাস মাছ, চাল, আটা, সুজি, খেসারি ডাল, মটর ডাল, ছোলা, মসলা, তেল, ধনিয়া পাতা, দারুচিনি, এলাচ, লবঙ্গ, গোলমরিচ, পাঙ্গাস মাছ, ইলিশ, রুই, কাতলা, মাগুর, তেলাপিয়া, শিং, কই, চিংড়ি, বোয়াল, টেংরা, গরুর মাংস, খাসির মাংস, হাঁস, কোয়েল, কবুতর, মুরগির ডিম, হাঁসের ডিম, বেগুন, কপি, ফুলকপি, বাঁধাকপি, লাউ, কুমড়া, করলা, ঝিঙে, পটল, শসা, ঢেঁড়স, শাক, পালং শাক, লাল শাক, পুঁই শাক, কচু শাক, কলমি শাক, কচু, কচুর লতি, করোল্লা, চাল গুরা করানো, গ্যাস লাইট, দিয়াশলাই, ধুনদুল, চিংড়ি, শুটকি


server 

বাজার, চাল, পোলার চাল, চাউল, মাছ, গোস্তো, গোসত, গোস্ত, মুরগী, মুরগি, কক মুরগি, তেল, তৈল, সয়াবিন তেল, সয়াবিন, পেয়াজ, পিয়াজ, হলুদ, হলদি, সরিষা তৈল, শরিসা তৈল, সরিশা তৈল, রশুন, রসুন, আদা, তাল-মিশ্রি, তাল মিশ্রি, ময়দা, আলু, ডাল, লবণ, দুধ, নুডুলস, চিনা বাদাম, সেমাই, হুইল পাউডার, চিনি, মসলা, সাবান, ভিমবার, ডিম, মরিচ, টমেটো, রেহা, মুলা, পেঁয়াজ, তরকারি, অন্যন্য বাজার, ধইন্যাপাতা, পান, পেপে, বরবটি, ধইন্যা পাতা, করলা, করোল্লা, করোলা, 
লেবু, সিম, হলুদের গুরা, পাঙ্গাস, পাঙ্গাস মাছ, চাল, আটা, সুজি, খেসারি ডাল, মটর ডাল, ছোলা, মসলা, তেল, ধনিয়া পাতা, দারুচিনি, এলাচ, লবঙ্গ, গোলমরিচ, পাঙ্গাস মাছ, ইলিশ, রুই, কাতলা, মাগুর, তেলাপিয়া, শিং, কই, চিংড়ি, বোয়াল, টেংরা, গরুর মাংস, খাসির মাংস, হাঁস, কোয়েল, কবুতর, মুরগির ডিম, হাঁসের ডিম, বেগুন, কপি, ফুলকপি, বাঁধাকপি, লাউ, কুমড়া, করলা, ঝিঙে, পটল, শসা, ঢেঁড়স, শাক, পালং শাক, লাল শাক, পুঁই শাক, কচু শাক, কলমি শাক, কচু, কচুর লতি,
 লাউ, লেবু

 বাজার => শাকসবজি, শাক, মাছ, মাংস, ডিম, ধ
'শাকসবজি', 'আলু, বেগুন, টমেটো, কপি, ফুলকপি, বাঁধাকপি, লাউ, কুমড়া, ঝিঙে, পটল, শসা, ঢেঁড়স, করলা, করোল্লা, করোলা, বরবটি, মুলা, পেপে'),
'শাক',     'পালং শাক, লাল শাক, পুঁই শাক, কচু শাক, কলমি শাক, ধনিয়া পাতা, ধইন্যা পাতা, কচুর লতি'),
'মাছ',     ' পাঙ্গাস, পাঙ্গাস মাছ, ইলিশ, রুই, কাতলা, মাগুর, তেলাপিয়া, শিং, কই, চিংড়ি, বোয়াল, টেংরা'),
'মাংস',     'গরুর মাংস, খাসির মাংস, মুরগী, মুরগি, কক মুরগি, হাঁস, কোয়েল, কবুতর'),
'ডিম',    'মুরগির ডিম, হাঁসের ডিম'),
'ধান-চাল-আটা জাতীয়', 'চাল, চাউল, পোলার চাল, আটা, ময়দা, সুজি, নুডুলস, সেমাই, হুইল পাউডার'),
'ডাল জাতীয়', 'ডাল, খেসারি ডাল, মটর ডাল, ছোলা'),
'তেল-চর্বি', 'তেল, তৈল, সয়াবিন, সয়াবিন তেল, সরিষা তৈল, শরিসা তৈল, সরিশা তৈল'),
'মসলা', 'হলুদ, হলদি, হলুদের গুরা, মরিচ, রসুন, রশুন, আদা, দারুচিনি, এলাচ, লবঙ্গ, গোলমরিচ, মসলা'),
'নিত্যপ্রয়োজনীয়', 'লবণ, চিনি, দুধ, চিনা বাদাম, সাবান, ভিমবার'),
'অন্যান্য', 'তাল-মিশ্রি, তাল মিশ্রি, রেহা, পেঁয়াজ, পেয়াজ, পিয়াজ, লেবু, পান, অন্যন্য বাজার');




category ar system tw agei ase je - category gula select option hisabe dekhabe notun add kora o option ase . 
thik seivabe sub_category o baniye daw. selected category hole sei category te jodi sub_category thake tobe show korbe na hoy add new option show korbe. 